uyencorki/uvc-ai-stm32/STM32Cube_FW_N6/Middlewares/ST/VideoEncoder_EWL/ewl_impl.c
/**
  ******************************************************************************
  * @file    ewl_impl.c
  * @author  GPM Application Team
  * @brief   Encoder Wrapper Layer for Video Encoder (VENC) IP
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include "ewl.h"
#include "ewl_impl.h"
#include "stm32n6xx_hal.h"
#include "stm32n6xx_ll_venc.h"
#include "reg_offset_v7.h"



/* Global variables ----------------------------------------------------------*/

#ifdef TRACE_EWL
/* static strings used to display hardware configuration in trace */
static const char *busTypeName[7] = {"UNKNOWN", "AHB", "OCP", "AXI", "PCI", "AXIAHB", "AXIAPB"};
static const char *synthLangName[3] = {"UNKNOWN", "VHDL", "VERILOG"};
u32 mem_counter = 0;
#endif /* TRACE_EWL */

/* Private typedef -----------------------------------------------------------*/


/* Private defines -----------------------------------------------------------*/

#ifndef EWL_TIMEOUT
#define EWL_TIMEOUT 100UL
#endif /* EWL_TIMEOUT */

#ifndef EWL_DEFAULT_POOL_SIZE
#define EWL_DEFAULT_POOL_SIZE 0x190000
#endif /* EWL_DEFAULT_POOL_SIZE */

#ifndef APP_VENC_INIT_TRACE
#define APP_VENC_INIT_TRACE 1
#endif

#if APP_VENC_INIT_TRACE
#define ENC_TRACE(...) printf(__VA_ARGS__)
#else
#define ENC_TRACE(...)
#endif

/* Private macros ------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
static VENC_EWL_TypeDef ewl_instance;
/* Private function prototypes -----------------------------------------------*/

/* Functions Definition ------------------------------------------------------*/

/**
  * @brief  Read ASIC ID register, static implementation
  * @retval u32 returns the ASIC ID and version (VENC register 0)
  */
u32 EWLReadAsicID(void)
{
  u32 id;

  ENC_TRACE("[EWL] ReadAsicID enter\r\n");
  id = LL_VENC_ReadRegister(0UL);
  ENC_TRACE("[EWL] ReadAsicID val=0x%08lX\r\n", (unsigned long)id);
  return id;
}

/**
  * @brief  Reads ASIC capability registers, static implementation
  * @retval EWLHwConfig_t structure containing all hardware ASIC configurations
  */
EWLHwConfig_t EWLReadAsicConfig(void)
{
  ENC_TRACE("[EWL] ReadAsicConfig enter\r\n");

  /* read first part of the configuration stored in register 63 */
  u32 cfgval = LL_VENC_ReadRegister(63UL);
  ENC_TRACE("[EWL] ReadAsicConfig reg63=0x%08lX\r\n", (unsigned long)cfgval);
  EWLHwConfig_t cfg_info;
  cfg_info.maxEncodedWidth = cfgval & ((1U << 12U) - 1U);
  cfg_info.h264Enabled = (cfgval >> 27U) & 1U;
  cfg_info.vp8Enabled = (cfgval >> 26U) & 1U;
  cfg_info.jpegEnabled = (cfgval >> 25U) & 1U;
  cfg_info.vsEnabled = (cfgval >> 24U) & 1U;
  cfg_info.rgbEnabled = (cfgval >> 28U) & 1U;
  cfg_info.searchAreaSmall = (cfgval >> 29U) & 1U;
  cfg_info.scalingEnabled = (cfgval >> 30U) & 1U;

  cfg_info.busType = (cfgval >> 20U) & 15U;
  cfg_info.synthesisLanguage = (cfgval >> 16U) & 15U;
  cfg_info.busWidth = (cfgval >> 12U) & 15U;

  /* read second part of the configuration stored in register 296 */
  cfgval = LL_VENC_ReadRegister(296UL);
  ENC_TRACE("[EWL] ReadAsicConfig reg296=0x%08lX\r\n", (unsigned long)cfgval);

  cfg_info.addr64Support = (cfgval >> 31U) & 1U;
  cfg_info.dnfSupport = (cfgval >> 30U) & 1U;
  cfg_info.rfcSupport = (cfgval >> 28U) & 3U;
  cfg_info.enhanceSupport = (cfgval >> 27U) & 1U;
  cfg_info.instantSupport = (cfgval >> 26U) & 1U;
  cfg_info.svctSupport = (cfgval >> 25U) & 1U;
  cfg_info.inAxiIdSupport = (cfgval >> 24U) & 1U;
  cfg_info.inLoopbackSupport = (cfgval >> 23U) & 1U;
  cfg_info.irqEnhanceSupport = (cfgval >> 22U) & 1U;

  PTRACE("EWLReadAsicConfig:\n"
         "    maxEncodedWidth   = %d\n"
         "    h264Enabled       = %s\n"
         "    jpegEnabled       = %s\n"
         "    vp8Enabled        = %s\n"
         "    vsEnabled         = %s\n"
         "    rgbEnabled        = %s\n"
         "    searchAreaSmall   = %s\n"
         "    scalingEnabled    = %s\n"
         "    address64bits     = %s\n"
         "    denoiseEnabled    = %s\n"
         "    rfcEnabled        = %s\n"
         "    instanctEnabled   = %s\n"
         "    busType           = %s\n"
         "    synthesisLanguage = %s\n"
         "    busWidth          = %d\n",
         cfg_info.maxEncodedWidth,
         cfg_info.h264Enabled == 1 ? "YES" : "NO",
         cfg_info.jpegEnabled == 1 ? "YES" : "NO",
         cfg_info.vp8Enabled == 1 ? "YES" : "NO",
         cfg_info.vsEnabled == 1 ? "YES" : "NO",
         cfg_info.rgbEnabled == 1 ? "YES" : "NO",
         cfg_info.searchAreaSmall == 1 ? "YES" : "NO",
         cfg_info.scalingEnabled == 1 ? "YES" : "NO",
         cfg_info.addr64Support == 1 ? "YES" : "NO",
         cfg_info.dnfSupport == 1 ? "YES" : "NO",
         cfg_info.rfcSupport == 0 ? "NO" :
         (cfg_info.rfcSupport == 2 ? "LUMA" : (cfg_info.rfcSupport == 1 ? "CHROMA" : "FULL")),
         cfg_info.instantSupport == 1 ? "YES" : "NO",
         cfg_info.busType < 7 ? busTypeName[cfg_info.busType] : "UNKNOWN",
         cfg_info.synthesisLanguage < 3
         ? synthLangName[cfg_info.synthesisLanguage]
         : "ERROR",
         cfg_info.busWidth * 32);

  return cfg_info;
}

/**
  * @brief Allocate resources and setup the wrapper module
  * @note   implementation depends on the OS compatibility setup in ewl_conf.h
  * @param  param EWLInitParam_t type of encoding to be done
  * @note   0 : H264
  *         1 : JPEG
  * @retval void* pointer to the EWL instance
  * @note Only one instance is supported. No apparent need for multi-instance support.
  */
const void *EWLInit(EWLInitParam_t *param)
{
  u32 client_type;

  ENC_TRACE("[EWL] Init enter param=0x%08lX\r\n", (unsigned long)param);

