uyencorki/uvc-ai-stm32/STM32Cube_FW_N6/Middlewares/ST/VideoEncoder_EWL/ewl_impl.c
  PTRACE("EWLInit: Start\n");

  if (param == NULL)
  {
    ENC_TRACE("[EWL][ERR] Init param is NULL\r\n");
    return NULL;
  }

  client_type = param->clientType;
  ENC_TRACE("[EWL] Init raw clientType=%lu (H264=%u JPEG=%u VP8=%u)\r\n",
            (unsigned long)client_type,
            (unsigned int)EWL_CLIENT_TYPE_H264_ENC,
            (unsigned int)EWL_CLIENT_TYPE_JPEG_ENC,
            (unsigned int)EWL_CLIENT_TYPE_VP8_ENC);

  if ((client_type != EWL_CLIENT_TYPE_H264_ENC) &&
      (client_type != EWL_CLIENT_TYPE_JPEG_ENC))
  {
    ENC_TRACE("[EWL][ERR] Init unsupported clientType=%lu\r\n", (unsigned long)client_type);
    return NULL;
  }
  ENC_TRACE("[EWL] Init clientType accepted=%lu\r\n", (unsigned long)client_type);

  u8 *mem_pool = NULL;
  size_t mem_pool_size = EWL_DEFAULT_POOL_SIZE;

#if (EWL_ALLOC_API == EWL_USE_THREADX_MM) || (EWL_ALLOC_API == EWL_USE_STM32MPM_MM)
  /* for ThreadX and STM32MPM, a user defined pool is required */
  EWLPoolChoiceCb(&mem_pool, &mem_pool_size);
  ENC_TRACE("[EWL] Init pool choice ptr=0x%08lX size=%lu\r\n",
            (unsigned long)mem_pool, (unsigned long)mem_pool_size);
  if (mem_pool == NULL)
  {
    PTRACE("error : memory pool pointer NULL");
    return NULL;
  }
#endif /* EWL_ALLOC_API */
  /* set pool parameters in instance */
  ewl_instance.pool = mem_pool;
  ewl_instance.pool_size = mem_pool_size;
  ENC_TRACE("[EWL] Init pool set done\r\n");

#if (EWL_ALLOC_API == EWL_USE_MALLOC_MM)
  /* nothing to do if malloc is used for memory management */
#elif (EWL_ALLOC_API == EWL_USE_FREERTOS_MM)
  /* no initialization required for freertos MM */
#elif (EWL_ALLOC_API == EWL_USE_THREADX_MM)
  uint32_t err;
  /* if ThreadX is chosen as memory management, initialize a byte pool */
  err = tx_byte_pool_create(&ewl_instance.byte_pool, "ewl byte pool", mem_pool, mem_pool_size);
  if (err != TX_SUCCESS)
  {
    return NULL;
  }
#elif (EWL_ALLOC_API == EWL_USE_STM32MPM_MM)
#error "no STM32MPM yet"
#elif (EWL_ALLOC_API == EWL_USER_MM)
#else
#error "incorrect EWL memory management configuration"
#endif /* EWL_ALLOC_API */

#if (EWL_SYNC_API == EWL_USE_POLLING_SYNC)
  /* no need for specific tools for polling synchronization */
#elif (EWL_SYNC_API == EWL_USE_THREADX_SYNC)
  /* if threadx is chosen as synchronization, initialize an event flags tool */
  err = tx_event_flags_create(&ewl_instance.flag_events, "EWL_event_group");
  if (err != TX_SUCCESS)
  {
    return NULL;
  }
  HAL_NVIC_SetPriority(VENC_IRQn, 0x07, 0);
  HAL_NVIC_EnableIRQ(VENC_IRQn);
#elif (EWL_SYNC_API == EWL_USE_FREERTOS_SYNC)
  /* FREERTOS synchronization requires a semaphore. Initialize it and put ID in instance */
  ewl_instance.ewl_event_group = xEventGroupCreate();
  if(ewl_instance.ewl_event_group == NULL){
    ENC_TRACE("[EWL][ERR] Init xEventGroupCreate failed\r\n");
    return NULL;
  }
  ENC_TRACE("[EWL] Init event group=0x%08lX\r\n", (unsigned long)ewl_instance.ewl_event_group);
  HAL_NVIC_SetPriority(VENC_IRQn, 0x07, 0);
  HAL_NVIC_EnableIRQ(VENC_IRQn);
  ENC_TRACE("[EWL] Init NVIC configured\r\n");
#elif (EWL_SYNC_API == EWL_USER_SYNC)
#else
#error "incorrect EWL synchronization configuration"
#endif /* EWL_SYNC_API */

  /* set client type and pool attributes */
  ewl_instance.clientType = client_type;
  ENC_TRACE("[EWL] Init done instance=0x%08lX\r\n", (unsigned long)&ewl_instance);

  return (void *)&ewl_instance;
}

/**
  * @brief  Release the wrapper module by freeing all the resources
  * @param  inst     EWL instance to release
  * @retval i32 error code : EWL_OK, EWL_ERROR
  * @note no error possible in this implementation, only returns EWL_OK
  */
i32 EWLRelease(const void *inst)
{
  assert_param(inst != NULL);

  const VENC_EWL_TypeDef *enc = (const VENC_EWL_TypeDef *)inst;
#if (EWL_ALLOC_API == EWL_USE_THREADX_MM)
  i32 err = tx_byte_pool_delete(&ewl_instance.byte_pool);
  if (err)
  {
    PTRACE("error deleting encoder byte pool");
  }
  err = tx_event_flags_delete(&ewl_instance.flag_events);
  if (err)
  {
    PTRACE("error deleting encoder flag events");
  }
#elif (EWL_ALLOC_API == EWL_USE_STM32MPM_MM)
#elif (EWL_ALLOC_API == EWL_USER_MM)
#elif (EWL_ALLOC_API == EWL_USE_FREERTOS_MM)
  vEventGroupDelete(ewl_instance.ewl_event_group);
#else
#endif /* EWL_ALLOC_API */
  /* save memory pool address */
  u8 *pool = enc->pool;
  /* free the associated pool */
  EWLPoolReleaseCb(&pool);

  PTRACE("EWLRelease: instance freed\n");
  return EWL_OK;
}

/** Note that EWLWriteReg, EWLEnableHW and EWLDisableHW have the same functionality.
  * This behaviour and API is defined in the IP SW integration guide and needs to be
  * implemented this way for compatibility with the higher level encoding software stack.
  */

/**
  * @brief  Set the content of a hadware register
  * @param  inst       EWL instance (unused)
  * @param  offset     offset of the register to change (in bytes)
  * @param  val        value the register shall be set to
  * @retval None
  */
void EWLWriteReg(const void *inst, u32 offset, u32 val)
{
  (void)inst;
  /* offset is defined in the EWL API in bytes. convert to number of registers by shifting */
  LL_VENC_WriteRegister((offset >> 2), val);
}

/**
  * @brief  Set the content of a hadware register
  * @param  inst       EWL instance (unused)
  * @param  offset     offset of the register to change (in bytes)
  * @param  val        value the register shall be set to
  * @retval None
  */
void EWLEnableHW(const void *inst, u32 offset, u32 val)
{
  (void)inst;
  /* offset is defined in the EWL API in bytes. convert to number of registers by shifting */
  LL_VENC_WriteRegister((offset >> 2), val);
}

/**
  * @brief  Set the content of a hadware register
  * @param  inst       EWL instance (unused)
  * @param  offset     offset of the register to change (in bytes)
  * @param  val        value the register shall be set to
  * @retval None
  */
void EWLDisableHW(const void *inst, u32 offset, u32 val)
{
  (void)inst;
  /* offset is defined in the EWL API in bytes. convert to number of registers by shifting */
  LL_VENC_WriteRegister((offset >> 2), val);
}

/**
  * @brief  Retrieve the content of a hadware register
  * @note   The status register will be read after every MB
so it may be needed to buffer it's content if reading
the HW register is slow.
  * @param  inst      EWL instance affected
  * @param  offset    offset of the register to read (in bytes)
  * @retval u32       desired register's value
  */
u32 EWLReadReg(const void *inst, u32 offset)
{
  (void)inst;
  /* offset is defined in the EWL API in bytes. convert to number of registers by shifting */
  return LL_VENC_ReadRegister((offset >> 2));
}

/**
  * @brief  Allocate a frame buffer (contiguous linear RAM memory)
  * @param  instance     EWL instance associated with the buffer to allocate
  * @param  size         size in bytes of the requested memory
  * @param  info         structure containing the allocated memory buffer parameters
  * @retval i32          0 for success or a negative error code
  */
__weak i32 EWLMallocRefFrm(const void *instance, u32 size, EWLLinearMem_t *info)
{
  return EWLMallocLinear(instance, size, info);
}

/**
  * @brief   Release a frame buffer previously allocated with EWLMallocRefFrm
  * @param  instance     EWL instance associated with the buffer to free
  * @param  info         structure containing the memory buffer parameters
  * @retval None
  */
__weak void EWLFreeRefFrm(const void *instance, EWLLinearMem_t *info)
{
  EWLFreeLinear(instance, info);
}

/**
  * @brief  Allocate a contiguous, linear RAM  memory buffer
  * @note   implementation depends on the OS compatibility setup in ewl_conf.h
  * @param  instance     EWL instance associated with the buffer to allocate
  * @param  size         size in bytes of the requested memory
  * @param  info         structure containing the allocated memory buffer parameters
  * @retval i32          0 for success or a negative error code
  */
__weak i32 EWLMallocLinear(const void *instance, u32 size, EWLLinearMem_t *info)
{
  if (instance == NULL)
  {
    return EWL_ERROR;
  }
  VENC_EWL_TypeDef *inst = (VENC_EWL_TypeDef *) instance;
  /* make size 8-byte aligned */
  u32 size_aligned = ALIGNED_SIZE(size);
  info->size = size_aligned;

