uyencorki/uvc-ai-stm32/STM32Cube_FW_N6/Middlewares/ST/VideoEncoder_EWL/ewl_impl.c
#if (EWL_ALLOC_API == EWL_USE_MALLOC_MM)
  /* allocate using malloc and check return */
  inst->chunks[inst->totalChunks] = (u32 *)malloc(size_aligned);
  if (inst->chunks[inst->totalChunks] == NULL)
  {
    return EWL_ERROR;
  }

  /* align given malloc buffer */
  inst->alignedChunks[inst->totalChunks] = (u32 *) ALIGNED_SIZE((u32)inst->chunks[inst->totalChunks]);
  /* put the aligned pointer in the return structure */
  info->virtualAddress = inst->alignedChunks[inst->totalChunks++];
#elif (EWL_ALLOC_API == EWL_USE_FREERTOS_MM)
  info->virtualAddress = pvPortMalloc(size_aligned);
#elif (EWL_ALLOC_API == EWL_USE_THREADX_MM)
  i32 err = tx_byte_allocate(&inst->byte_pool, (void **) &inst->chunks[inst->totalChunks], size_aligned, TX_NO_WAIT);
  if (err != TX_SUCCESS)
  {
    return EWL_ERROR;
  }
  if (inst->chunks[inst->totalChunks] == NULL)
  {
    return EWL_ERROR;
  }

  /* align given malloc buffer */
  inst->alignedChunks[inst->totalChunks] = (u32 *) ALIGNED_SIZE((u32)inst->chunks[inst->totalChunks]);
  /* put the aligned pointer in the return structure */
  info->virtualAddress = inst->alignedChunks[inst->totalChunks++];
#elif (EWL_ALLOC_API == EWL_USE_STM32MPM_MM)
#error "no STM32MPM yet"
#elif (EWL_ALLOC_API == EWL_USER_MM)
  return EWL_ERROR;
#else
#error "incorrect EWL memory management configuration"
#endif /* EWL_ALLOC_API */

  if (info->virtualAddress == NULL)
  {
    PTRACE("EWLMallocLinear unable to allocate %8d bytes\n", size_aligned);
    return EWL_ERROR;
  }

  /* bus address is the same as virtual address because no MMU */
  info->busAddress = (ptr_t)info->virtualAddress;

  /* check buffer alignment */
  assert_param((info->busAddress & 0b111UL) == 0U);

#ifdef TRACE_EWL
  mem_counter += size;
  PTRACE("EWLMallocLinear allocated %8d bytes --> %p / %d. Total : %d\n", size_aligned, info->virtualAddress,
         info->busAddress, mem_counter);
#endif /* TRACE_EWL */
  return EWL_OK;
}

/**
  * @brief   Release a frame buffer previously allocated with EWLMallocLinear
  * @note   implementation depends on the OS compatibility setup in ewl_conf.h
  * @param  instance     EWL instance associated with the buffer to free
  * @param  info         structure containing the memory buffer parameters
  * @retval None
  */
__weak void EWLFreeLinear(const void *instance, EWLLinearMem_t *info)
{
  VENC_EWL_TypeDef *inst = (VENC_EWL_TypeDef *) instance;
#if (EWL_ALLOC_API == EWL_USE_MALLOC_MM)
  /* find the pointer corresponding to the aligned buffer */
  for (u32 i = 0; i < inst->totalChunks; i++)
  {
    if (inst->alignedChunks[i] == info->virtualAddress)
    {
      free(inst->chunks[i]);
      break;
    }
  }
#elif (EWL_ALLOC_API == EWL_USE_FREERTOS_MM)
  vPortFree(info->virtualAddress);
#elif (EWL_ALLOC_API == EWL_USE_THREADX_MM)
  for (u32 i = 0; i < inst->totalChunks; i++)
  {
    if (inst->alignedChunks[i] == info->virtualAddress)
    {
      tx_byte_release(inst->chunks[i]);
      break;
    }
  }

#elif (EWL_ALLOC_API == EWL_USE_STM32MPM_MM)
#error "no STM32MPM yet"
#elif (EWL_ALLOC_API == EWL_USER_MM)
  return;
#else
#error "incorrect EWL memory management configuration"
#endif /* EWL_ALLOC_API */
  info->virtualAddress = NULL;
  info->busAddress = 0;
  info->size = 0;
}

/**
  * @brief  Reserve HW resource for currently running codec
  * @note  Currently unused due to only one instance being supported
  * @param  inst EWL instance (unused)
  * @retval i32  0 for success or a negative error code
  */
i32 EWLReserveHw(const void *inst)
{
  assert_param(inst != NULL);
  return EWL_OK;
}

/**
  * @brief  Release HW resource for currently running codec
  * @note  Currently unused due to only one instance being supported
  * @param  inst  EWL instance (unused)
  * @retval i32   0 for success or a negative error code
  */
void EWLReleaseHw(const void *inst)
{
  assert_param(inst != NULL);
}

/**
  * @brief            Allocate a memory block. Same functionality as the ANSI C malloc()
  * @note             Implementation depends on the OS compatibility setup in ewl_conf.h
  * @param  n         Number of bytes to allocate
  * @retval  void     pointer to the allocated space, or NULL if there is insufficient memory available
  */
__weak void *EWLmalloc(u32 n)
{
  void * p = NULL;
#if (EWL_ALLOC_API == EWL_USE_MALLOC_MM)
  p = malloc((size_t)n);
#elif (EWL_ALLOC_API == EWL_USE_FREERTOS_MM)
  p = pvPortMalloc(n);
#elif (EWL_ALLOC_API == EWL_USE_THREADX_MM)
  p = NULL;
  i32 err = tx_byte_allocate(&ewl_instance.byte_pool, &p, n, TX_NO_WAIT);
  if (err != TX_SUCCESS)
  {
    return NULL;
  }
#elif (EWL_ALLOC_API == EWL_USE_STM32MPM_MM)
#error "no STM32MPM yet"
#elif (EWL_ALLOC_API == EWL_USER_MM)

#else
#error "incorrect EWL memory management configuration"
#endif /* EWL_ALLOC_API */
#ifdef TRACE_EWL
  mem_counter += n;
#endif /* TRACE_EWL */
  PTRACE("EWLmalloc %8d bytes --> %p, total : %d\n", n, p, mem_counter);
  return p;
}

/**
  * @brief    Deallocates or frees a memory block. Same functionality as the ANSI C free()
  * @note     Implementation depends on the OS compatibility setup in ewl_conf.h
  * @param p  Previously allocated memory block to be freed
  * @retval   None
  */
__weak void EWLfree(void *p)
{
  PTRACE("EWLfree %p\n", p);

#if (EWL_ALLOC_API == EWL_USE_MALLOC_MM)
  free(p);
#elif (EWL_ALLOC_API == EWL_USE_FREERTOS_MM)
  vPortFree(p);
#elif (EWL_ALLOC_API == EWL_USE_THREADX_MM)
  tx_byte_release(p);
#elif (EWL_ALLOC_API == EWL_USE_STM32MPM_MM)
#error "no STM32MPM yet"
#elif (EWL_ALLOC_API == EWL_USER_MM)
  return;
#else
#error "incorrect EWL memory management configuration"
#endif /* EWL_ALLOC_API */
}

/**
  * @brief            Allocate an array in memory with elements initialized
  *       to 0. Same functionality as the ANSI C calloc()
  * @param  n         Number of elements
  * @param  s         Size of each element (in bytes)
  * @retval  void     pointer to the allocated space, or NULL if there is insufficient memory available
  */
__weak void *EWLcalloc(u32 n, u32 s)
{
  void *p = EWLmalloc(n * s);
  EWLmemset(p, 0, n * s);
  return p;
}

/**
  * @brief  Copies characters between buffers. Same functionality as the ANSI C memcpy()
  * @param  d          Destination buffer
  * @param  s          Buffer to copy from
  * @param  n          Number of bytes to copy
  * @retval void* The value of destination d
  */
 void *EWLmemcpy(void *d, const void *s, u32 n)
{
  return memcpy(d, s, (size_t)n);
}

/**
  * @brief  Sets buffers to a specified character. Same functionality as the ANSI C memset()
  * @param  d     Pointer to destination
  * @param  c     Character to set
  * @param  n     Number of characters
  * @retval void* The value of destination d
  */
void *EWLmemset(void *d, i32 c, u32 n)
{
  return memset(d, c, (size_t)n);
}

/**
  * @brief  Compares two buffers. Same functionality is the ANSI C memcmp()
  * @param  s1     Buffer to compare
  * @param  s2     Buffer to compare
  * @param  n      Number of bytes to compare
  * @retval int Zero if the first n bytes of s1 match s2
  */
int EWLmemcmp(const void *s1, const void *s2, u32 n)
{
  return memcmp((const uint8_t *) s1, (const uint8_t *) s2, (size_t)n);
}

/**
  * @brief  Wait for the encoder hardware
  * @note   Implementation depends on the OS compatibility setup in ewl_conf.h
  * @param  inst     EWL instance (used to get the instance sync tools)
  * @param  slicesReady Number of encoded slices. (ignored if NULL)
  * @retval i32 EWL_OK on success, EWL_HW_WAIT_TIMEOUT on timeout error, EWL_ERROR on other error
  */
__weak i32 EWLWaitHwRdy(const void *inst, u32 *slicesReady)
{
  /* Check invalid parameters */
  if (inst == NULL)
  {
    return EWL_HW_WAIT_ERROR;
  }
  /* Copied and adapted from polling reference implementation*/

  u32 ret = EWL_HW_WAIT_TIMEOUT;
#if (EWL_SYNC_API == EWL_USE_POLLING_SYNC)
  PTRACE("EWLWaitHw: Start\n");
  volatile u32 irq_stats;
  u32 tickstart = HAL_GetTick();
  u32 prevSlicesReady = 0;
  /* check how to clear IRQ flags for VENC */
  u32 clrByWrite1 = (EWLReadReg(inst, BASE_HWFuse2) & HWCFGIrqClearSupport);
  do
  {
    irq_stats = VENC_REG(1UL);
    /* Get the number of completed slices from ASIC registers. */
    if (slicesReady != NULL)
    {
      *slicesReady = (VENC_REG(21UL) >> 16) & 0xFFUL;
    }
    PTRACE("EWLWaitHw: IRQ stat = %08x\n", irq_stats);
    u32 hw_handshake_status = READ_BIT(VENC_REG(BASE_HEncInstantInput >> 2U), (1U << 29U));
    /* ignore the irq status of input line buffer in hw handshake mode */
    if ((irq_stats == ASIC_STATUS_LINE_BUFFER_DONE) && (hw_handshake_status != 0UL))
    {
      VENC_REG(1U) = (1<<9);
      continue;
    }
    if ((irq_stats & ASIC_STATUS_ALL) != 0UL)
    {
      /* clear IRQ and slice ready status */
      u32 clr_stats;
      irq_stats &= (~(ASIC_STATUS_SLICE_READY | ASIC_IRQ_LINE));

      if (clrByWrite1 != 0UL)
      {
        clr_stats = ASIC_STATUS_SLICE_READY | ASIC_IRQ_LINE;
      }
      else
      {
        clr_stats = irq_stats;
      }
      EWLWriteReg(inst, 0x04, clr_stats);
      ret = EWL_OK;
      break;
    }

    if (slicesReady != NULL)
    {
      if (*slicesReady > prevSlicesReady)
      {
        ret = EWL_OK;
        break;
      }
    }
  } while ((HAL_GetTick() - tickstart) < EWL_TIMEOUT);
  if (slicesReady != NULL)
  {
    PTRACE("EWLWaitHw: slicesReady = %d\n", *slicesReady);
  }
#elif (EWL_SYNC_API == EWL_USE_THREADX_SYNC)
  VENC_EWL_TypeDef *enc = (VENC_EWL_TypeDef *) inst;
  /* wait for event flags set in IRQ */
  u32 events = 0;
  u32 status = tx_event_flags_get(&enc->flag_events, 1, TX_OR_CLEAR, (ULONG *) &events, EWL_TIMEOUT);
  if (status != TX_SUCCESS)
  {
    PTRACE("sync error\n");
    return EWL_HW_WAIT_TIMEOUT;
  }
  ret = EWL_OK;
  /* Get the number of completed slices from ASIC registers. */
  if (slicesReady != NULL)
  {
    *slicesReady = (VENC_REG(21UL) >> 16) & 0xFFUL;
    PTRACE("EWLWaitHw: slicesReady = %d\n", *slicesReady);
  }
#elif (EWL_SYNC_API == EWL_USE_FREERTOS_SYNC)
  if (xEventGroupWaitBits(ewl_instance.ewl_event_group, 1, pdTRUE, pdTRUE, EWL_TIMEOUT) == 0)
  {
    return EWL_HW_WAIT_TIMEOUT;
  }
  ret = EWL_OK;
  /* Get the number of completed slices from ASIC registers. */
  if (slicesReady != NULL)
  {
    *slicesReady = (VENC_REG(21UL) >> 16) & 0xFFUL;
    PTRACE("EWLWaitHw: slicesReady = %d\n", *slicesReady);
  }
#elif (EWL_SYNC_API == EWL_USER_SYNC)
  return EWL_ERROR;
#else
#endif /* EWL_SYNC_API */
  return ret;
}


/* Used for memory pool selection */
/* If pool_ptr is not NULL and size is bigger than 0, pool pointer is used to initialize the EWL instance memory pool */
/* if pool_ptr is NULL or size is 0 after this function call, the pool is allocation on the heap using malloc */
/* the default pool size is set in ewl_impl.C but can be overwritten by the user. */
__weak void EWLPoolChoiceCb(u8 **pool_ptr, size_t *size)
{
  *size = EWL_DEFAULT_POOL_SIZE;
  *pool_ptr = (u8 *) malloc(EWL_DEFAULT_POOL_SIZE);
}

__weak void EWLPoolReleaseCb(u8 **pool_ptr)
{
  free(*pool_ptr);
}


void VENC_IRQHandler(void)
{
  u32 hw_handshake_status = READ_BIT(VENC_REG(BASE_HEncInstantInput >> 2U), (1U << 29U));
  uint32_t irq_status = VENC_REG(1U);
  if(!hw_handshake_status && (irq_status & ASIC_STATUS_FUSE))
  {
    VENC_REG(1U) = ASIC_STATUS_FUSE | ASIC_IRQ_LINE;
    /* read back the IRQ status to update its value */
    irq_status = VENC_REG(1U);
  }
  /* See if there are other flags than the FUSE status raised */
  if(irq_status != 0U)
  {
    /* status flag is raised, clear the ones that the IRQ needs to clear and signal to EWLWaitHwReady */
    VENC_REG(1U) = ASIC_STATUS_SLICE_READY | ASIC_IRQ_LINE;
#if (EWL_SYNC_API == EWL_USE_THREADX_SYNC)
    /* set event flags for synchronization */
    u32 status = tx_event_flags_set(&ewl_instance.flag_events, 1, TX_OR);
    if (status != TX_SUCCESS)
    {

      return ;
    }
#elif (EWL_SYNC_API == EWL_USE_FREERTOS_SYNC)
    BaseType_t higher_prio_task_woken = pdFALSE;
    if(xEventGroupSetBitsFromISR(ewl_instance.ewl_event_group, 1, &higher_prio_task_woken) == pdFAIL){
      PTRACE("set flags error\n");
    }
    portYIELD_FROM_ISR(higher_prio_task_woken);
#endif /* EWL_SYNC_API */
  }
}
